{"article":"On Friday the legislature of Taiwan, the Legislative Yuan, voted 66 to 27 to legalize same-sex marriage, seven days ahead of the two-year deadline issued by the country\'s Constitutional Court in 2017. This would make Taiwan the first country in Asia to legally recognize unions between same-sex couples. The law is to take effect late this week.\\nThe Legislative Yuan debated three competing bills, and selected the one posed by the country\'s cabinet, which used the word \\"marriage,\\" over the two posed by conservatives, which used the terms \\"same-sex family relationship\\" and \\"same-sex union.\\" The selected bill does not offer same-sex couples all the same rights as their heterosexual counterparts; there are limits on adoption rights and marriage with foreigners.\\nJennifer Lu of Marriage Equality Coalition Taiwan said, \\"[I]t\'s still not full marriage rights; we still need to fight for co-adoption rights, and we are not sure about foreigner and Taiwanese marriage, and also gender equality education.\\"\\nThe Taiwanese government held a referendum in November 2018, allowing the population to vote on same-sex marriage, and 67% came out against.\\nXiaogang Wei of the Beijing Gender Health Education Institute commented on the Legislative Yuan\'s decision: \\"The Chinese government has pointed to cultural tradition as a reason for same-sex marriage being unsuitable in China. But the decision in Taiwan, which shares a cultural tradition with us, proves that Chinese culture can be open, diverse and progressive.\\"\\nIn mainland China, which claims sovereignty over Taiwan, homosexuality is technically not illegal, but late last year a same-sex erotica author was sentenced to ten years in prison, and same-sex marriage is not recognized.\\nIn 2017, Taiwan\'s Constitutional Court, which rules on constitutional matters, said not allowing gay citizens to marry constituted \\"different treatment\\" incompatible with the constitution. The decision prompted objections from conservatives opposing recognition of gay marriage.","domain":"","date":"","authors":"","title":"","target":"discrimination"}